/* Last Translator: zhtest */

#include "zh_lang_api.h"

static ZH_LANG s_lang =
{
   {
      /* Identification */

      "be",
      "Belorussian",
      "Беларуская",
      "",
      "UTF8",
      "",

      /* Month names */

      "Студзень",
      "Люты",
      "Сакавік",
      "Красавік",
      "Май",
      "Чэрвень",
      "Ліпень",
      "Жнівень",
      "Верасень",
      "Кастрычнік",
      "Лістапад",
      "Снежань",

      /* Day names */

      "Нядзеля",
      "Панядзелак",
      "Аўторак",
      "Серада",
      "Чацвер",
      "Пятніца",
      "Субота",

      

      "Файлы дадзеных    # Запісы     Апошняе зм.     Памер",
      "Патрэбныя яшчэ прыклады ?",
      "Стар.N",
      "** Subtotal **",
      "* Subsubtotal *",
      "*** Total ***",
      "Ins",
      "   ",
      "Няправільная дата",
      "Дыяпазон: ",
      " - ",
      "Д/Н",
      "НЯПРАВІЛЬНЫ ВЫРАЗ",

      /* Error description names */

      "Невядомая памылка",
      "Няправільны аргумент",
      "Перапаўненне масіва",
      "Перапаўненне радка",
      "Перапаўненне ліку",
      "Дзяленне на нуль",
      "Колькасная памылка",
      "Сінтаксічная памылка",
      "Занадта складаная аперацыя",
      "",
      "",
      "Бракуе памяці",
      "Невядомая функцыя",
      "Метад не экспартаван",
      "Пераменная не існуе",
      "Аліас не існуе",
      "Пераменная не экспаравана",
      "Непрымальныя сімвалы ў імяні аліаса",
      "Аліас ужо выкарыстоўваецца",
      "",
      "Памылка створання",
      "Памылка адкрыцця",
      "Памылка зачынення",
      "Памылка чытання",
      "Памылка запісу",
      "Памылка друка",
      "",
      "",
      "",
      "",
      "Аперацыя не падтрымліваецца",
      "Мяжа перавышана",
      "Выяўлена пашкоджанне",
      "Памылка тыпу дадзеных",
      "Памылка памеру дадзеных",
      "Файл не адкрыт",
      "Файл не індэксіраван",
      "Патрабуецца эксклюзіўны доступ",
      "Патрабуецца блакоўка",
      "Запіс не дазволена",
      "Збой блакоўкі пры дадатку",
      "Блакоўка не атрымалася",
      "",
      "",
      "",
      "Object destructor failure",
      "Няправільная колькасць аргументаў",
      "доступ да масіву",
      "надання масіў",
      "не масіў",
      "параўнанне",

      /* Internal error names */

      "Невыпраўленая памылка %d: ",
      "Памылка пры аднаўленні",
      "Не вызначаны ERRORBLOCK() для памылкі",
      "Перавышаная мяжа рэкурсіўных выклікаў апрацоўшчыка памылак",
      "Не атрымоўваецца загрузіць RDD",
      "Няправільны тып метаду %s",
      "zh_xgrab не можа размеркаваць памяць",
      "zh_xrealloc выкліканы з NULL паказальнікам",
      "zh_xrealloc выкліканы з няправільным паказальнікам",
      "zh_xrealloc не можа пераразмеркаваць памяць",
      "zh_xfree выкліканы з няправільным паказальнікам",
      "zh_xfree выкліканы з NULL паказальнікам",
      "Не знойдзеная стартавая працэдура: '%s'",
      "Адсутнічае стартавая працэдура",
      "VM: Невядомы код",
      "%s: чакаўся сімвал",
      "%s: няправільны тып сімвала для self",
      "%s: чакаўся блок кода",
      "%s: няправільны тып элемента на вяршыні стэка",
      "Выйсце за межы стэка",
      "%s: спроба капіраваць элемент на сябе",
      "%s: няправільнае імя пераменнай",
      "Перапаўненне буфера памяці",
      "zh_xgrab requested to allocate zero bytes",
      "zh_xrealloc requested to resize to zero bytes",
      "zh_xalloc requested to allocate zero bytes",

      /* Texts */

      "DD/MM/YYYY",
      "Д",
      "Н"
   }
};

#define ZH_LANG_ID      BE
#include "zh_lang_register_messages.h"
