/* Last Translator: zhtest */

#include "zh_lang_api.h"

static ZH_LANG s_lang =
{
   {
      /* Identification */

      "sr_cyr",
      "Serbian (cyrillic)",
      "Српски",
      "",
      "UTF8",
      "",

      /* Month names */

      "Јануар",
      "Фебруар",
      "Март",
      "Април",
      "Мај",
      "Јун",
      "Јул",
      "Август",
      "Септембар",
      "Октобар",
      "Новембар",
      "Децембар",

      /* Day names */

      "Недеsа",
      "Понедеsак",
      "Уторак",
      "Среда",
      "Четвртак",
      "Петак",
      "Субота",

      

      "Фаjл са подацима  # Записи     Последoа изм.   Величина",
      "Нужно још примера ?",
      "Стр.N",
      "** Subtotal **",
      "* Subsubtotal *",
      "*** Total ***",
      "Ins",
      "   ",
      "Погрешан податак",
      "Диапазон: ",
      " - ",
      "Д/Н",
      "ПОГРЕШАН ИЗРАЗ",

      /* Error description names */

      "Непозната грешка",
      "Непознат аргумент",
      "Пробијена граница",
      "Предугачка реч",
      "Превелик број",
      "Делеoе са нулом",
      "Бројчана грешка",
      "Грешка у синтакси",
      "Исувише сложена операција",
      "",
      "",
      "Недовоsно меморије",
      "Непозната функција",
      "Метод не експортован",
      "Промеoива непостоји",
      "Алиас не постоји",
      "Промеoива не експортована",
      "Недозвоsен симбол у имену алиаса",
      "Алиас се веz користи",
      "",
      "Грешка приликом креираoа",
      "Грешка приликом отвараoа",
      "Грешка приликом затвараoа",
      "Грешка приликом читаoа",
      "Грешка приликом уписа",
      "Грешка приликом штампе",
      "",
      "",
      "",
      "",
      "Операција није подржана",
      "Лимит превршен",
      "ДЕТЕКТОВАНО ОШТЕZЕOЕ",
      "Грешка у типу податка",
      "Грешка у величини податка",
      "Фајл није отворен",
      "Фајл није индексиран",
      "Потребан ексклузивни приступ",
      "Потребно закsучаваoе",
      "Упис није дозвоsен",
      "Додаваoе записа није дозвоsено",
      "Грешка приликом закsучаваoа",
      "",
      "",
      "",
      "Object destructor failure",
      "Неверное количество аргументов",
      "приступ низу",
      "величина низа",
      "није у низу",
      "упорђеoе",

      /* Internal error names */

      "Неисправимая ошибка %d: ",
      "Ошибка при восстановлении",
      "Не определен ERRORBLOCK() для ошибки",
      "Превышен предел рекурсивных вызовов обработчика ошибок",
      "Не удается загрузить RDD",
      "Неверный тип метода %s",
      "zh_xgrab не може распределить память",
      "zh_xrealloc вызван с NULL указателем",
      "zh_xrealloc вызван с неверным указателем",
      "zh_xrealloc ене может перераспределить память",
      "zh_xfree вызван с неверным указателем",
      "zh_xfree вызван с NULL указателем",
      "Не найдена стартовая процедура: '%s'",
      "Отсутствует стартовая процедура",
      "VM: Неизвестный код",
      "%s: ожидался символ",
      "%s: неверный тип символа для self",
      "%s: ожидался кодоблок",
      "%s: неверный тип элемента на вершине стека",
      "Выход за пределы стека",
      "%s: попытка копировать элемент на себя",
      "%s: неверное имя переменной",
      "Переполнение буфера памяти",
      "zh_xgrab requested to allocate zero bytes",
      "zh_xrealloc requested to resize to zero bytes",
      "zh_xalloc requested to allocate zero bytes",

      /* Texts */

      "DD.MM.YYYY",
      "Д",
      "Н"
   }
};

#define ZH_LANG_ID      SR_CYR
#include "zh_lang_register_messages.h"
