/* Last Translator: zhtest */

#include "zh_lang_api.h"

static ZH_LANG s_lang =
{
   {
      /* Identification */

      "uk",
      "Ukrainian",
      "Українська",
      "",
      "UTF8",
      "",

      /* Month names */

      "Січень",
      "Лютий",
      "Березень",
      "Квітень",
      "Травень",
      "Червень",
      "Липень",
      "Серпень",
      "Вересень",
      "Жовтень",
      "Листопад",
      "Грудень",

      /* Day names */

      "Неділя",
      "Понеділок",
      "Вівторок",
      "Середа",
      "Четвер",
      "П'ятниця",
      "Субота",

      

      "Файли даних       # Записи     Остання зм.     Розмір",
      "Потрібні ще приклади ?",
      "Стор.N",
      "** Всього **",
      "* Разом *",
      "*** ПІДСУМОК ***",
      "Вст",
      "   ",
      "Помилкова дата",
      "Діапазон: ",
      " - ",
      "Т/Н",
      "ПОМИЛКОВИЙ ВИРАЗ",

      /* Error description names */

      "Невідома помилка",
      "Помилковий аргумент",
      "Переповнення масиву",
      "Переповнення рядка",
      "Переповнення числа",
      "Ділення на нуль",
      "Числова помилка",
      "Синтаксична помилка",
      "Надмірно складна операція",
      "",
      "",
      "Бракує пам'яті",
      "Невідома функція",
      "Метод не експортований",
      "Змінна не існує",
      "Псевдонім бази(alias)не існує",
      "Змінна не експортована",
      "Заборонені символи в псевдонімі бази",
      "Псевдонім бази вже використовується",
      "",
      "Помилка під час створення",
      "Помилка під час відкриття",
      "Помилка під час закриття",
      "Помилка під час читання",
      "Помилка під час запису",
      "Помилка під час друку",
      "",
      "",
      "",
      "",
      "Операція не підтримується",
      "Ліміт перевищено",
      "Виявлено пошкодження",
      "Помилка в типі даних",
      "Помилка в розмірі даних",
      "Файл не відкритий",
      "Файл не проіндексований",
      "Потрібен ексклюзивний доступ",
      "Потрібне блокування",
      "Запис заборонено",
      "Збій блокування під час додавання запису",
      "Заблокувати не вдалося",
      "",
      "",
      "",
      "Object destructor failure",
      "Помилкова кількість аргументів",
      "доступ до масиву",
      "присвоєння масиву",
      "не масив",
      "порівняння",

      /* Internal error names */

      "Невиправна помилка %d: ",
      "Помилка під час відновлення",
      "Не визначено ERRORBLOCK() для помилки",
      "Перевищена межа рекурсивних викликів обробника помилок",
      "Не вдається завантажити RDD",
      "Помилковий тип методу %s",
      "zh_xgrab не може розподілити пам'ять",
      "zh_xrealloc викликано з NULL покажчиком",
      "zh_xrealloc викликано з помилковим покажчиком",
      "zh_xrealloc не може перерозподілити пам'ять",
      "zh_xfree викликано з помилковим покажчиком",
      "zh_xfree викликано з NULL покажчиком",
      "Не знайдена стартова процедура: '%s'",
      "Відсутня стартова процедура",
      "VM: Невідомий код",
      "%s: очікувався символ",
      "%s: помилковий тип символу для self",
      "%s: очікувався блок коду",
      "%s: помилковий тип елементу на вершині стеку",
      "Вихід за межі стеку",
      "%s: спроба копіювати елемент на себе ж",
      "%s: помилкове ім'я змінної",
      "Переповнення буферу пам'яті",
      "zh_xgrab requested to allocate zero bytes",
      "zh_xrealloc requested to resize to zero bytes",
      "zh_xalloc requested to allocate zero bytes",

      /* Texts */

      "DD.MM.YYYY",
      "Т",
      "Н"
   }
};

#define ZH_LANG_ID      UK
#include "zh_lang_register_messages.h"
